Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
#include <ESP8266WiFi.h>
#include <ArduinoJson.h>
#include <ESP8266WebServer.h>
#include <WiFiManager.h>
#include <EEPROM.h>
#include <ESP8266mDNS.h>
#include <WebSocketsServer.h>
#include "config.h"

// Forward declarations
void initializeOutputs();
void initializeWiFi();
void initializeWiFiManager();
void checkConfigPortalTrigger();
void initializeWebServer();
void executeOutputCommand(int pin, bool active, int brightnessPercent);
void updateBlinkingOutputs();
void updateChasingLightGroups();
void setOutputInterval(int index, unsigned int intervalMs);
void createChasingGroup(uint8_t groupId, uint8_t* outputIndices, uint8_t count, unsigned int intervalMs);
void deleteChasingGroup(uint8_t groupId);
void saveChasingGroups();
void loadChasingGroups();
void saveOutputState(int index);
void loadOutputStates();
void saveAllOutputStates();
void saveCustomParameters();
void loadCustomParameters();

// Global variables
// Web Server
ESP8266WebServer* server = nullptr;
WebSocketsServer* ws = nullptr;
WiFiManager wifiManager;

// WebSocket broadcast timer
unsigned long lastBroadcast = 0;
const unsigned long BROADCAST_INTERVAL = 500; // Broadcast every 500ms

#define MAX_CHASING_GROUPS 4

// Chasing group structure
struct ChasingGroup {
    uint8_t groupId;
    bool active;
    char name[21]; // 20 chars + null terminator
    uint8_t outputIndices[8]; // Max 8 outputs per group
    uint8_t outputCount;
    uint16_t interval; // Step interval in ms
    uint8_t currentStep; // Current active output in sequence
    unsigned long lastStepTime;
};

// EEPROM structure for ESP8266
struct EEPROMData {
    char deviceName[40];
    bool outputStates[8];
    uint8_t outputBrightness[8];
    char outputNames[8][21]; // 20 chars + null terminator
    uint16_t outputIntervals[8]; // Blink interval in milliseconds (0 = no blink)
    // Chasing groups data
    uint8_t chasingGroupCount;
    struct {
        uint8_t groupId;
        bool active;
        char name[21];
        uint8_t outputIndices[8];
        uint8_t outputCount;
        uint16_t interval;
    } chasingGroups[MAX_CHASING_GROUPS];
    uint8_t checksum;
};
EEPROMData eepromData;

String macAddress;
char customDeviceName[40] = DEVICE_NAME; // Custom device name from WiFiManager
bool portalRunning = false;
unsigned long portalButtonPressTime = 0;
bool wifiConnected = false;

// Output pin configuration
int outputPins[MAX_OUTPUTS] = LED_PINS;
bool outputStates[MAX_OUTPUTS] = {false};
int outputBrightness[MAX_OUTPUTS] = {255}; // 0-255 for PWM
String outputNames[MAX_OUTPUTS]; // Custom names for outputs
unsigned int outputIntervals[MAX_OUTPUTS] = {0}; // Blink interval in ms (0 = no blink)
unsigned long lastBlinkTime[MAX_OUTPUTS] = {0}; // Last blink toggle time
bool blinkState[MAX_OUTPUTS] = {false}; // Current blink state (for internal tracking)
int8_t outputChasingGroup[MAX_OUTPUTS] = {-1, -1, -1, -1, -1, -1, -1}; // Which chasing group owns this output (-1 = none)

// Chasing light groups
ChasingGroup chasingGroups[MAX_CHASING_GROUPS];
uint8_t chasingGroupCount = 0;

// Timing variables

void broadcastStatus(); // Forward declaration

void wsEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
    switch(type) {
        case WStype_DISCONNECTED:
            Serial.printf("[WS] Client #%u disconnected\n", num);
            break;
        case WStype_CONNECTED:
            {
                IPAddress ip = ws->remoteIP(num);
                Serial.printf("[WS] Client #%u connected from %d.%d.%d.%d\n", num, ip[0], ip[1], ip[2], ip[3]);
                broadcastStatus(); // Send current status to new client
            }
            break;
        case WStype_TEXT:
            Serial.printf("[WS] Received from #%u: %s\n", num, payload);
            break;
    }
}

void broadcastStatus() {
    if (!ws) return;
    
    DynamicJsonDocument doc(2048);
    doc["macAddress"] = macAddress;
    doc["name"] = customDeviceName;
    doc["wifiMode"] = WiFi.getMode() == WIFI_AP ? "AP" : "STA";
    doc["ip"] = WiFi.getMode() == WIFI_AP ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
    doc["ssid"] = WiFi.getMode() == WIFI_AP ? String(AP_SSID) : WiFi.SSID();
    doc["apClients"] = WiFi.softAPgetStationNum();
    doc["freeHeap"] = ESP.getFreeHeap();
    doc["uptime"] = millis();
    doc["buildDate"] = String(__DATE__) + " " + String(__TIME__);
    doc["flashUsed"] = ESP.getSketchSize();
    doc["flashFree"] = ESP.getFreeSketchSpace();
    doc["flashPartition"] = 1044464; // Program partition size (from platformio build output)
    
    JsonArray outputs = doc.createNestedArray("outputs");
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        JsonObject output = outputs.createNestedObject();
        output["pin"] = outputPins[i];
        output["active"] = outputStates[i];
        output["brightness"] = map(outputBrightness[i], 0, 255, 0, 100);
        output["name"] = outputNames[i];
        output["interval"] = outputIntervals[i];
        output["chasingGroup"] = outputChasingGroup[i];
    }
    
    JsonArray groups = doc.createNestedArray("chasingGroups");
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].active) {
            JsonObject group = groups.createNestedObject();
            group["groupId"] = chasingGroups[i].groupId;
            group["name"] = chasingGroups[i].name;
            group["interval"] = chasingGroups[i].interval;
            group["outputCount"] = chasingGroups[i].outputCount;
            JsonArray groupOutputs = group.createNestedArray("outputs");
            for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                groupOutputs.add(outputPins[chasingGroups[i].outputIndices[j]]);
            }
        }
    }
    
    String response;
    serializeJson(doc, response);
    ws->broadcastTXT(response);
}

void setup() {
    Serial.begin(115200);
    delay(100);
    
    // Initialize EEPROM for ESP8266
    EEPROM.begin(EEPROM_SIZE);
    
    Serial.println("\n\n========================================");
    Serial.println("  RailHub8266 ESP8266 Controller v1.0");
    Serial.println("========================================");
    Serial.println("[BOOT] Chip ID: " + String(ESP.getChipId(), HEX));
    Serial.println("[BOOT] CPU Frequency: " + String(ESP.getCpuFreqMHz()) + " MHz");
    Serial.println("[BOOT] Flash Size: " + String(ESP.getFlashChipSize() / 1024) + " KB");
    Serial.println("[BOOT] Free Heap: " + String(ESP.getFreeHeap()) + " bytes");
    
    // Get MAC address for unique identification
    macAddress = WiFi.macAddress();
    Serial.println("[INIT] MAC Address: " + macAddress);
    
    // Initialize portal trigger pin
    Serial.println("[INIT] Configuring portal trigger pin (GPIO " + String(PORTAL_TRIGGER_PIN) + ")");
    pinMode(PORTAL_TRIGGER_PIN, INPUT_PULLUP);
    
