Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
    // Set custom parameters
    WiFiManagerParameter custom_device_name("device_name", "Device Name", customDeviceName, 40);
    
    // Add parameters to WiFiManager
    wifiManager.addParameter(&custom_device_name);
    
    // Minimal configuration for ESP8266 to save RAM
    wifiManager.setMinimumSignalQuality(20);  // Higher = fewer networks shown = less RAM
    wifiManager.setRemoveDuplicateAPs(true);
    
    // Disable features to save memory
    wifiManager.setShowInfoUpdate(false);  // Don't show info in update mode
    wifiManager.setShowInfoErase(false);   // Don't show erase button
    
    // Set save config callback
    wifiManager.setSaveConfigCallback([]() {
        Serial.println("[WIFI] Configuration saved!");
        Serial.print("[WIFI] Device Name: ");
        Serial.println(customDeviceName);
        Serial.println("[WIFI] WiFi credentials will be used on next boot");
        Serial.println("[WIFI] Restarting ESP8266 to apply new configuration...");
        delay(2000);
        ESP.restart();
    });
    
    // Set short timeout to free memory after config
    wifiManager.setConfigPortalTimeout(300); // 5 minutes timeout
    
    // Disable debug output to save RAM
    wifiManager.setDebugOutput(false);
    

    
    // Set AP callback
    wifiManager.setAPCallback([](WiFiManager *myWiFiManager) {
        Serial.println("\n========================================");
        Serial.println("     CONFIGURATION MODE ACTIVE");
        Serial.println("========================================");
        Serial.println("[WIFI] AP Mode Started");
        Serial.println("[WIFI] AP SSID: " + String(WIFIMANAGER_AP_SSID));
        Serial.println("[WIFI] AP Password: " + String(WIFIMANAGER_AP_PASSWORD));
        Serial.println("[WIFI] AP IP Address: " + WiFi.softAPIP().toString());
        Serial.println("[WIFI] Configuration Portal: http://192.168.4.1");
        Serial.println("[INFO] Connect your device to the AP above");
        Serial.println("[INFO] Portal running on port 80");
        Serial.println("========================================\n");
        
        // Blink LED to indicate config mode (active LOW)
        for (int i = 0; i < 10; i++) {
            digitalWrite(STATUS_LED_PIN, !digitalRead(STATUS_LED_PIN));
            delay(100);
        }
        digitalWrite(STATUS_LED_PIN, LOW); // On (active LOW)
    });
    
    // Configure static IP for portal
    IPAddress portal_ip(192, 168, 4, 1);
    IPAddress portal_gateway(192, 168, 4, 1);
    IPAddress portal_subnet(255, 255, 255, 0);
    wifiManager.setAPStaticIPConfig(portal_ip, portal_gateway, portal_subnet);
    
    // Try to connect with saved credentials or start portal
    Serial.println("[WIFI] Attempting to connect to WiFi...");
    Serial.print("[WIFI] Config AP SSID: ");
    Serial.println(WIFIMANAGER_AP_SSID);
    
    // Use NULL for open AP if password is empty, otherwise use the password
    const char* apPassword = (strlen(WIFIMANAGER_AP_PASSWORD) == 0) ? NULL : WIFIMANAGER_AP_PASSWORD;
    
    unsigned long connectStart = millis();
    if (wifiManager.autoConnect(WIFIMANAGER_AP_SSID, apPassword)) {
        // Connected to WiFi successfully
        unsigned long connectDuration = millis() - connectStart;
        wifiConnected = true;
        
        Serial.println("\n========================================");
        Serial.println("     WIFI CONNECTION SUCCESSFUL");
        Serial.println("========================================");
        Serial.print("[WIFI] IP Address: ");
        Serial.println(WiFi.localIP());
        Serial.print("[WIFI] SSID: ");
        Serial.println(WiFi.SSID());
        Serial.print("[WIFI] Signal Strength: ");
        Serial.print(WiFi.RSSI());
        Serial.println(" dBm");
        Serial.print("[WIFI] MAC Address: ");
        Serial.println(WiFi.macAddress());
        Serial.print("[WIFI] Connection Time: ");
        Serial.print(connectDuration);
        Serial.println("ms");
        Serial.println("========================================\n");
        
        // Get custom parameters
        strncpy(customDeviceName, custom_device_name.getValue(), 40);
        saveCustomParameters();
        
        // Start mDNS service
        String hostname = String(customDeviceName);
        hostname.toLowerCase();
        hostname.replace(" ", "-");
        if (MDNS.begin(hostname.c_str())) {
            Serial.print("[MDNS] mDNS responder started: ");
            Serial.print(hostname);
            Serial.println(".local");
            MDNS.addService("http", "tcp", 80);
            Serial.println("[MDNS] HTTP service added");
        } else {
            Serial.println("[ERROR] mDNS failed to start");
        }
        
        // Solid LED to indicate connected (active LOW)
        digitalWrite(STATUS_LED_PIN, LOW);
    } else {
        // Failed to connect - fallback to AP mode
        Serial.println("[ERROR] Failed to connect - starting fallback AP mode");
        wifiConnected = false;
        initializeWiFi();
    }
}

void checkConfigPortalTrigger() {
    static bool warningShown = false;
    
    // Check if portal trigger button is pressed
    if (digitalRead(PORTAL_TRIGGER_PIN) == LOW) {
        if (portalButtonPressTime == 0) {
            portalButtonPressTime = millis();
            warningShown = false;
            Serial.println("[PORTAL] Config button pressed (hold for 3s to trigger)");
        } else {
            unsigned long holdDuration = millis() - portalButtonPressTime;
            
            // Warning at 2.5 seconds - only show once
            if (holdDuration > 2500 && !warningShown && !portalRunning) {
                Serial.println("[PORTAL] Warning: Portal trigger in 0.5s...");
                warningShown = true;
            }
            
            if (holdDuration > PORTAL_TRIGGER_DURATION && !portalRunning) {
                Serial.println("[PORTAL] Portal trigger detected! Resetting WiFi and restarting...");
                Serial.print("[PORTAL] Free heap before reset: ");
                Serial.print(ESP.getFreeHeap());
                Serial.println(" bytes");
                portalRunning = true;
                
                // Blink LED rapidly (active LOW)
                Serial.println("[PORTAL] Blinking status LED (confirmation)");
                for (int i = 0; i < 20; i++) {
                    digitalWrite(STATUS_LED_PIN, !digitalRead(STATUS_LED_PIN));
                    delay(50);
                }
                
                // Clear WiFi settings (ESP8266 stores WiFi creds in flash)
                Serial.println("[PORTAL] Disconnecting WiFi and clearing saved networks...");
                WiFi.disconnect(true); // true = also erase stored credentials
                delay(1000);
                
                // Restart to trigger portal
                Serial.println("[PORTAL] Restarting ESP8266 in 1s...");
                Serial.flush();
                delay(1000);
                ESP.restart();
            }
        }
    } else {
        if (portalButtonPressTime > 0) {
            unsigned long pressDuration = millis() - portalButtonPressTime;
            Serial.print("[PORTAL] Config button released after ");
            Serial.print(pressDuration);
            Serial.println("ms (trigger requires 3000ms)");
        }
        portalButtonPressTime = 0;
        portalRunning = false;
        warningShown = false;
    }
}

void saveCustomParameters() {
    Serial.println("[EEPROM] Saving custom parameters...");
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update device name
    strncpy(eepromData.deviceName, customDeviceName, 39);
    eepromData.deviceName[39] = '\0';
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    Serial.print("[EEPROM] Custom parameters saved: Device Name = '");
    Serial.print(customDeviceName);
    Serial.println("'");
}

void saveChasingGroups() {
    Serial.println("[EEPROM] Saving chasing groups...");
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update chasing groups
    eepromData.chasingGroupCount = 0;
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].active) {
            eepromData.chasingGroups[i].groupId = chasingGroups[i].groupId;
            eepromData.chasingGroups[i].active = true;
            strncpy(eepromData.chasingGroups[i].name, chasingGroups[i].name, 20);
            eepromData.chasingGroups[i].name[20] = '\0';
            eepromData.chasingGroups[i].outputCount = chasingGroups[i].outputCount;
            eepromData.chasingGroups[i].interval = chasingGroups[i].interval;
            for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                eepromData.chasingGroups[i].outputIndices[j] = chasingGroups[i].outputIndices[j];
            }
            eepromData.chasingGroupCount++;
        } else {
            eepromData.chasingGroups[i].active = false;
        }
    }
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
