Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
    for (int i = 0; i < MAX_OUTPUTS; i++) {
        // Skip if output is part of a chasing group
        if (outputChasingGroup[i] >= 0) continue;
        
        // Only process if output is active and has a blink interval set
        if (outputStates[i] && outputIntervals[i] > 0) {
            // Check if it's time to toggle
            if (currentMillis - lastBlinkTime[i] >= outputIntervals[i]) {
                lastBlinkTime[i] = currentMillis;
                blinkState[i] = !blinkState[i];
                
                // Toggle the output
                if (blinkState[i]) {
                    analogWrite(outputPins[i], outputBrightness[i]);
                } else {
                    analogWrite(outputPins[i], 0);
                }
            }
        } else if (outputStates[i] && outputIntervals[i] == 0) {
            // No blinking - ensure output is solid on
            if (!blinkState[i]) {
                analogWrite(outputPins[i], outputBrightness[i]);
                blinkState[i] = true;
            }
        }
    }
}

void createChasingGroup(uint8_t groupId, uint8_t* outputIndices, uint8_t count, unsigned int intervalMs, const char* groupName = nullptr) {
    if (groupId >= MAX_CHASING_GROUPS || count == 0 || count > 8) {
        Serial.println("[ERROR] Invalid chasing group parameters");
        return;
    }
    
    // Find or create group slot
    int groupSlot = -1;
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].groupId == groupId || !chasingGroups[i].active) {
            groupSlot = i;
            break;
        }
    }
    
    if (groupSlot == -1) {
        Serial.println("[ERROR] No available chasing group slots");
        return;
    }
    
    // Clear old group memberships for these outputs
    for (int i = 0; i < count; i++) {
        uint8_t idx = outputIndices[i];
        if (idx < MAX_OUTPUTS) {
            outputChasingGroup[idx] = -1;
        }
    }
    
    // Setup new group
    ChasingGroup* group = &chasingGroups[groupSlot];
    group->groupId = groupId;
    group->active = true;
    
    // Set group name (default: "Group X" if not provided)
    if (groupName != nullptr && strlen(groupName) > 0) {
        strncpy(group->name, groupName, 20);
        group->name[20] = '\0';
    } else {
        snprintf(group->name, 21, "Group %d", groupId);
    }
    
    group->outputCount = count;
    group->interval = intervalMs;
    group->currentStep = 0;
    group->lastStepTime = millis();
    
    for (int i = 0; i < count; i++) {
        group->outputIndices[i] = outputIndices[i];
        if (outputIndices[i] < MAX_OUTPUTS) {
            outputChasingGroup[outputIndices[i]] = groupId;
        }
    }
    
    // Turn on all outputs in group
    for (int i = 0; i < count; i++) {
        uint8_t idx = outputIndices[i];
        if (idx < MAX_OUTPUTS) {
            outputStates[idx] = true;
        }
    }
    
    // Initialize first output on, rest off
    for (int i = 0; i < count; i++) {
        uint8_t idx = outputIndices[i];
        if (idx < MAX_OUTPUTS) {
            if (i == 0) {
                analogWrite(outputPins[idx], outputBrightness[idx]);
            } else {
                analogWrite(outputPins[idx], 0);
            }
        }
    }
    
    saveChasingGroups();
    
    Serial.print("[CHASING] Group ");
    Serial.print(groupId);
    Serial.print(" created with ");
    Serial.print(count);
    Serial.print(" outputs, interval: ");
    Serial.print(intervalMs);
    Serial.println("ms");
}

void deleteChasingGroup(uint8_t groupId) {
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].groupId == groupId && chasingGroups[i].active) {
            // Free outputs from group
            for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                uint8_t idx = chasingGroups[i].outputIndices[j];
                if (idx < MAX_OUTPUTS) {
                    outputChasingGroup[idx] = -1;
                    // Turn off output
                    analogWrite(outputPins[idx], 0);
                    outputStates[idx] = false;
                }
            }
            
            // Clear group
            chasingGroups[i].active = false;
            chasingGroups[i].outputCount = 0;
            
            saveChasingGroups();
            
            Serial.print("[CHASING] Group ");
            Serial.print(groupId);
            Serial.println(" deleted");
            return;
        }
    }
    
    Serial.print("[ERROR] Chasing group ");
    Serial.print(groupId);
    Serial.println(" not found");
}

void setOutputInterval(int index, unsigned int intervalMs) {
    if (index < 0 || index >= MAX_OUTPUTS) {
        Serial.println("[ERROR] Invalid output index for interval: " + String(index));
        return;
    }
    
    outputIntervals[index] = intervalMs;
    
    // Reset blink timing
    lastBlinkTime[index] = millis();
    blinkState[index] = true;
    
    // If output is active and interval is set, start with ON state
    if (outputStates[index]) {
        if (intervalMs > 0) {
            analogWrite(outputPins[index], outputBrightness[index]);
            Serial.println("[INTERVAL] Output " + String(index) + " (GPIO " + String(outputPins[index]) + ") set to blink every " + String(intervalMs) + "ms");
        } else {
            analogWrite(outputPins[index], outputBrightness[index]);
            Serial.println("[INTERVAL] Output " + String(index) + " (GPIO " + String(outputPins[index]) + ") blinking disabled (solid)");
        }
    }
    
    // Save to EEPROM
    saveOutputState(index);
}

void initializeWebServer() {
    if (!server) return;
    
    // Serve minimal HTML page optimized for ESP8266 low RAM - send in chunks
    server->on("/", HTTP_GET, []() {
        server->setContentLength(CONTENT_LENGTH_UNKNOWN);
        server->send(200, "text/html", "");
        
        // Header chunk
        server->sendContent(F("<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>"
        "<title>RailHub8266</title><style>*{margin:0;padding:0;box-sizing:border-box}body{font-family:Arial,sans-serif;background:#1a1a1a;color:#e0e0e0;padding:20px}"
        ".card{background:#2a2a2a;border:1px solid #3a3a3a;padding:15px;margin-bottom:15px}h1{font-size:1.5rem;margin-bottom:10px}h2{font-size:1.2rem;margin-bottom:10px}"
        ".status{display:grid;grid-template-columns:1fr 1fr;gap:10px;margin-bottom:20px}.stat{background:#333;padding:10px;text-align:center}"
        ".value{font-size:1.5rem;color:#6c9bcf}.label{font-size:0.8rem;color:#999;margin-top:5px}"
        ".outputs{display:grid;gap:10px}.output{background:#333;padding:10px;display:flex;justify-content:space-between;align-items:center}"
        ".output.on{border-left:3px solid #4a9b6f}.output.blinking{border-left:3px solid #f39c12}.toggle{width:60px;height:30px;background:#555;cursor:pointer;position:relative}"
        ".toggle.on{background:#4a9b6f}.toggle::after{content:'';position:absolute;width:26px;height:26px;background:#fff;top:2px;left:2px;transition:0.2s}"
        ".toggle.on::after{left:32px}.brightness{display:flex;align-items:center;gap:10px;margin-top:8px}"
        ".brightness input{flex:1;height:6px;border-radius:3px;background:#555;outline:none;-webkit-appearance:none}"
        ".brightness input::-webkit-slider-thumb{-webkit-appearance:none;width:16px;height:16px;border-radius:50%;background:#6c9bcf;cursor:pointer}"
        ".brightness input::-moz-range-thumb{width:16px;height:16px;border-radius:50%;background:#6c9bcf;cursor:pointer;border:none}"
        ".brightness span{min-width:40px;text-align:right;font-size:0.9rem;color:#999}"
        ".interval{display:flex;align-items:center;gap:10px;margin-top:8px}"
        ".interval input{width:80px;padding:4px;background:#555;border:1px solid #666;color:#fff;border-radius:3px}"
        ".interval span{font-size:0.85rem;color:#999}"
        ".output.chasing{border-left:3px solid #9b59b6}"
        ".chasing-group{background:#3a2a4a;padding:10px;margin-bottom:10px;border-left:3px solid #9b59b6}"
        ".chasing-group h3{font-size:1rem;margin-bottom:5px;color:#9b59b6;cursor:pointer}"
        ".chasing-group h3:hover{color:#bb79d6}"
        ".group-info{font-size:0.85rem;color:#999}"
        ".output-name{cursor:pointer;font-weight:bold;color:#6c9bcf}"
        ".output-name:hover{color:#8bb5e0;text-decoration:underline}"
        "button{background:#6c9bcf;color:#fff;border:none;padding:10px 20px;cursor:pointer;margin-right:10px}"
        "button:hover{background:#5a8bc0}button.delete{background:#e74c3c}button.delete:hover{background:#c0392b}"
        ".info{font-size:0.9rem;color:#999}"
        ".tabs{display:flex;gap:5px;margin-bottom:15px}.tab{background:#333;padding:10px 20px;cursor:pointer;border:none;color:#999}"
        ".tab.active{background:#6c9bcf;color:#fff}.tab-content{display:none}.tab-content.active{display:block}"
        ".storage-bar{background:#333;height:20px;border-radius:3px;overflow:hidden;margin-top:5px;position:relative}"
        ".storage-fill{background:linear-gradient(90deg,#4a9b6f,#f39c12);height:100%;transition:width 0.3s}"
        ".storage-text{position:absolute;top:2px;left:0;right:0;text-align:center;font-size:0.75rem;color:#fff;text-shadow:1px 1px 2px rgba(0,0,0,0.8)}"
        ".modal{display:none;position:fixed;top:0;left:0;width:100%;height:100%;background:rgba(0,0,0,0.7);z-index:1000;align-items:center;justify-content:center}"
        ".modal.show{display:flex}"
        ".modal-content{background:#2a2a3a;padding:25px;border-radius:8px;min-width:350px;max-width:90%;box-shadow:0 4px 20px rgba(0,0,0,0.5)}"
        ".modal-header{font-size:1.2rem;font-weight:bold;margin-bottom:15px;color:#6c9bcf}"
        ".modal-input{width:100%;padding:10px;background:#555;border:1px solid #666;color:#fff;border-radius:4px;font-size:1rem;margin-bottom:15px}"
        ".modal-input:focus{outline:none;border-color:#6c9bcf}"
        ".modal-buttons{display:flex;gap:10px;justify-content:flex-end}"
        ".modal-buttons button{min-width:80px}"
        ".modal-buttons .cancel{background:#666}"
        ".modal-buttons .cancel:hover{background:#555}"
        "</style></head><body>"));
        
        // Modal dialog for name editing
        server->sendContent(F("<div id='nameModal' class='modal'><div class='modal-content'>"
        "<div class='modal-header' id='modalTitle'>Edit Name</div>"
        "<input type='text' id='modalInput' class='modal-input' maxlength='20' placeholder='Enter name...'>"
        "<div class='modal-buttons'>"
        "<button class='cancel' onclick='closeModal()'>Cancel</button>"
        "<button onclick='saveModalName()'>Save</button>"
        "</div></div></div>"));
        
        // Confirmation modal
        server->sendContent(F("<div id='confirmModal' class='modal'><div class='modal-content'>"
        "<div class='modal-header' id='confirmTitle'>Confirm</div>"
        "<div id='confirmMessage' style='margin-bottom:20px;color:#ccc'></div>"
        "<div class='modal-buttons'>"
        "<button class='cancel' onclick='closeConfirm()'>Cancel</button>"
        "<button class='delete' onclick='confirmYes()'>Delete</button>"
        "</div></div></div>"));
        
