Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        // Alert modal
        server->sendContent(F("<div id='alertModal' class='modal'><div class='modal-content'>"
        "<div class='modal-header' id='alertTitle'>Alert</div>"
        "<div id='alertMessage' style='margin-bottom:20px;color:#ccc'></div>"
        "<div class='modal-buttons'>"
        "<button onclick='closeAlert()'>OK</button>"
        "</div></div></div>"));
        
        // Body start
        server->sendContent(F("<div class='card'><h1>🚂 RailHub8266</h1><p class='info'>"));
        server->sendContent(String(customDeviceName));
        server->sendContent(F("</p></div><div class='card'><div class='tabs'>"
        "<button class='tab active' onclick='showTab(0)'>Status</button>"
        "<button class='tab' onclick='showTab(1)'>Settings</button>"
        "</div><div class='tab-content active' id='tab0'><h2>Status</h2><div class='status'>"
        "<div class='stat'><div class='value' id='uptime'>-</div><div class='label'>Uptime</div></div>"
        "<div class='stat'><div class='value' id='buildDate'>-</div><div class='label'>Build Date</div></div>"
        "</div><div style='margin-top:15px'><div class='label'>RAM (80 KB)</div>"
        "<div class='storage-bar'><div class='storage-fill' id='ramFill' style='width:0%'></div>"
        "<div class='storage-text' id='ramText'>-</div></div></div>"
        "<div style='margin-top:15px'><div class='label'>Program Flash (1 MB)</div>"
        "<div class='storage-bar'><div class='storage-fill' id='storageFill' style='width:0%'></div>"
        "<div class='storage-text' id='storageText'>-</div></div></div>"
        "<div style='margin-top:20px'><h2>Controls</h2>"
        "<button onclick='allOn()'>All ON</button><button onclick='allOff()'>All OFF</button><button onclick='refresh()'>Refresh</button>"
        "</div></div><div class='tab-content' id='tab1'><h2>Chasing Light Groups</h2>"
        "<div style='margin-bottom:15px'>"
        "<label style='display:block;margin-bottom:5px'>Group ID:</label>"
        "<input type='number' id='newGroupId' min='1' max='255' value='1' style='width:100px;padding:4px;background:#555;border:1px solid #666;color:#fff;border-radius:3px'><br>"
        "<label style='display:block;margin:10px 0 5px'>Interval (ms):</label>"
        "<input type='text' id='newGroupInterval' value='500' style='width:100px;padding:4px;background:#555;border:1px solid #666;color:#fff;border-radius:3px'><br>"
        "<label style='display:block;margin:10px 0 5px'>Select Outputs:</label>"
        "<div id='outputSelector'></div>"
        "<button onclick='createGroup()' style='margin-top:10px'>Create Group</button>"
        "</div><div id='chasingGroups'></div>"
        "<h2 style='margin-top:20px'>Outputs</h2><div class='outputs' id='outputs'></div></div></div>"));
        
        // JavaScript chunk
        server->sendContent(F("<script>function showTab(n){localStorage.setItem('activeTab',n);document.querySelectorAll('.tab').forEach((t,i)=>t.classList.toggle('active',i===n));"
        "document.querySelectorAll('.tab-content').forEach((c,i)=>c.classList.toggle('active',i===n));}"
        "let wsData=null;async function load(){let d;if(wsData){d=wsData;wsData=null;}else{try{const r=await fetch('/api/status');d=await r.json();}catch(err){console.error('[LOAD] Error:',err);return;}}if(!d)return;try{const activeEl=document.activeElement;const isFocused=activeEl&&activeEl.tagName==='INPUT'&&activeEl.type==='text'&&activeEl.closest('.interval');"
        "const focusedPin=isFocused?activeEl.closest('.output')?.querySelector('.output-name')?.getAttribute('onclick')?.match(/\\d+/)?.[0]:null;"
        "const cursorPos=isFocused?activeEl.selectionStart:null;const focusedVal=isFocused?activeEl.value:null;"
        "const usedRam=80-(d.freeHeap/1024);const ramPct=Math.round((usedRam/80)*100);"
        "document.getElementById('ramFill').style.width=ramPct+'%';"
        "document.getElementById('ramText').textContent=usedRam.toFixed(1)+'KB / 80KB ('+ramPct+'%)';"
        "const s=Math.floor(d.uptime/1000);document.getElementById('uptime').textContent=s+'s';"
        "if(d.buildDate)document.getElementById('buildDate').textContent=d.buildDate;"
        "if(d.flashUsed&&d.flashPartition){const pct=Math.round((d.flashUsed/d.flashPartition)*100);"
        "document.getElementById('storageFill').style.width=pct+'%';"
        "document.getElementById('storageText').textContent=(d.flashUsed/1024).toFixed(0)+'KB / '+(d.flashPartition/1024).toFixed(0)+'KB ('+pct+'%)';}"
        "const sel=document.getElementById('outputSelector');"
        "const checked=[];document.querySelectorAll('#outputSelector input:checked').forEach(cb=>checked.push(cb.value));"
        "sel.innerHTML='';"
        "d.outputs.forEach(out=>{"
        "const lbl=document.createElement('label');lbl.style.display='block';lbl.style.marginBottom='5px';"
        "const cb=document.createElement('input');cb.type='checkbox';cb.value=out.pin;cb.id='out_'+out.pin;"
        "cb.disabled=out.chasingGroup>=0;"
        "if(out.chasingGroup<0&&checked.includes(out.pin.toString()))cb.checked=true;"
        "lbl.appendChild(cb);"
        "const outName=out.name||'GPIO '+out.pin;"
        "let groupTag='';"
        "if(out.chasingGroup>=0){const grp=d.chasingGroups.find(g=>g.groupId===out.chasingGroup);groupTag=grp?' [In '+grp.name+']':' [In Group '+out.chasingGroup+']';}"
        "lbl.appendChild(document.createTextNode(' '+outName+groupTag));"
        "sel.appendChild(lbl);});"
        "const cg=document.getElementById('chasingGroups');cg.innerHTML='';"
        "if(d.chasingGroups&&d.chasingGroups.length>0){"
        "d.chasingGroups.forEach(g=>{"
        "const div=document.createElement('div');div.className='chasing-group';"
        "const outNames=g.outputs.map(pin=>{const o=d.outputs.find(x=>x.pin===pin);return o?(o.name||'GPIO '+pin):'GPIO '+pin;}).join(', ');"
        "div.innerHTML=`<h3 id='gname_${g.groupId}' onclick='editGName(${g.groupId},\"${g.name}\")'>${g.name}</h3>"
        "<div class='group-info'>${outNames} | ${g.interval}ms</div>`;"
        "const btn=document.createElement('button');btn.className='delete';btn.textContent='Delete';btn.onclick=()=>deleteGroup(g.groupId);div.appendChild(btn);"
        "cg.appendChild(div);});}else{cg.innerHTML='<p class=info>No active groups</p>';}"
        "const o=document.getElementById('outputs');o.innerHTML='';"
        "d.outputs.forEach((out,i)=>{"
        "const div=document.createElement('div');"
        "let cls='output'+(out.active?' on':'')+(out.interval>0?' blinking':'')+(out.chasingGroup>=0?' chasing':'');"
        "div.className=cls;"
        "let groupTag='';"
        "if(out.chasingGroup>=0){const grp=d.chasingGroups.find(g=>g.groupId===out.chasingGroup);groupTag=grp?' ['+grp.name+']':' [G'+out.chasingGroup+']';}"
        "div.innerHTML=`<div><span class='output-name' onclick='editOName(${out.pin},\"${out.name}\")'>${out.name || 'GPIO '+out.pin}${groupTag}</span>"
        "<div class='brightness'><input type='range' min='0' max='100' value='${out.brightness}' "
        "oninput='this.nextElementSibling.textContent=this.value+\"%\"' onchange='setBright(${out.pin},this.value)'>"
        "<span>${out.brightness}%</span></div>"
        "<div class='interval'><span>Interval:</span><input type='text' value='${out.interval}' "
        "onchange='setInt(${out.pin},this.value)' ${out.chasingGroup>=0?'disabled':''}><span>ms</span></div></div>"
        "<div class='toggle ${out.active?'on':''}' onclick='tog(${out.pin})'></div>`;"
        "o.appendChild(div);});"
        "if(focusedPin){const inputs=document.querySelectorAll('.interval input[type=text]');"
        "inputs.forEach(inp=>{const pin=inp.closest('.output')?.querySelector('.output-name')?.getAttribute('onclick')?.match(/\\d+/)?.[0];"
        "if(pin===focusedPin){inp.focus();if(cursorPos!==null){inp.setSelectionRange(cursorPos,cursorPos);inp.value=focusedVal||inp.value;}}});}"
        "}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function tog(pin){try{const r=await fetch('/api/status');const d=await r.json();"
        "const out=d.outputs.find(o=>o.pin===pin);await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,active:!out.active,brightness:out.brightness})});load();}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function setBright(pin,val){try{const r=await fetch('/api/status');const d=await r.json();"
        "const out=d.outputs.find(o=>o.pin===pin);await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,active:out.active,brightness:parseInt(val)})});}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function setInt(pin,val){try{await fetch('/api/interval',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,interval:parseInt(val)||0})});}catch(e){console.error(e);}}"));
        
        server->sendContent(F("let confirmCallback=null;function openConfirm(title,message,callback){"
        "document.getElementById('confirmTitle').textContent=title;"
        "document.getElementById('confirmMessage').textContent=message;"
        "confirmCallback=callback;"
        "document.getElementById('confirmModal').classList.add('show');}"
        "function closeConfirm(){document.getElementById('confirmModal').classList.remove('show');confirmCallback=null;}"
        "function confirmYes(){if(confirmCallback){confirmCallback();}closeConfirm();}"
        "document.getElementById('confirmModal').addEventListener('click',e=>{"
        "if(e.target.id==='confirmModal'){closeConfirm();}});"));
        
