Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        server->sendContent(F("function showAlert(title,message){"
        "document.getElementById('alertTitle').textContent=title;"
        "document.getElementById('alertMessage').textContent=message;"
        "document.getElementById('alertModal').classList.add('show');}"
        "function closeAlert(){document.getElementById('alertModal').classList.remove('show');}"
        "document.getElementById('alertModal').addEventListener('click',e=>{"
        "if(e.target.id==='alertModal'){closeAlert();}});"));
        
        server->sendContent(F("async function deleteGroup(gid){"
        "openConfirm('Delete Group','Are you sure you want to delete this chasing group?',async()=>{"
        "try{await fetch('/api/chasing/delete',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid})});load();}catch(e){console.error(e);}});}"));
        
        server->sendContent(F("let modalCallback=null;function openModal(title,currentVal,callback){"
        "document.getElementById('modalTitle').textContent=title;"
        "const input=document.getElementById('modalInput');"
        "input.value=currentVal||'';"
        "modalCallback=callback;"
        "document.getElementById('nameModal').classList.add('show');"
        "setTimeout(()=>input.focus(),100);}"
        "function closeModal(){document.getElementById('nameModal').classList.remove('show');modalCallback=null;}"
        "function saveModalName(){const val=document.getElementById('modalInput').value.trim();"
        "if(modalCallback){modalCallback(val);}closeModal();}"
        "document.getElementById('modalInput').addEventListener('keydown',e=>{"
        "if(e.key==='Enter'){saveModalName();}else if(e.key==='Escape'){closeModal();}});"
        "document.getElementById('nameModal').addEventListener('click',e=>{"
        "if(e.target.id==='nameModal'){closeModal();}});"));
        
        server->sendContent(F("async function editGName(gid,oldName){"
        "openModal('Edit Group Name',oldName,async(name)=>{"
        "if(name===oldName)return;"
        "const finalName=name.trim()||'Group '+gid;"
        "try{await fetch('/api/chasing/name',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid,name:finalName})});load();}catch(e){showAlert('Error',e.toString());console.error(e);}});}"));
        
        server->sendContent(F("async function editOName(pin,oldName){"
        "openModal('Edit Output Name',oldName||'GPIO '+pin,async(name)=>{"
        "const finalName=name.trim();"
        "if(finalName===(oldName||'GPIO '+pin))return;"
        "try{await fetch('/api/name',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,name:finalName})});load();}catch(e){showAlert('Error',e.toString());console.error(e);}});}"));
        
        server->sendContent(F("async function createGroup(){try{"
        "const gid=parseInt(document.getElementById('newGroupId').value);"
        "const interval=parseInt(document.getElementById('newGroupInterval').value);"
        "const outputs=[];"
        "document.querySelectorAll('#outputSelector input[type=checkbox]:checked').forEach(cb=>outputs.push(parseInt(cb.value)));"
        "if(outputs.length<2){showAlert('Validation Error','Please select at least 2 outputs');return;}"
        "if(gid<1||gid>255){showAlert('Validation Error','Group ID must be 1-255');return;}"
        "if(interval<50){showAlert('Validation Error','Interval must be at least 50ms');return;}"
        "await fetch('/api/chasing/create',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid,interval:interval,outputs:outputs})});"
        "document.getElementById('newGroupId').value=parseInt(gid)+1;load();}catch(e){showAlert('Error',e.toString());console.error(e);}}"));;
        
        server->sendContent(F("async function allOn(){try{const r=await fetch('/api/status');const d=await r.json();"
        "for(const o of d.outputs){await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:o.pin,active:true,brightness:100})});}}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function allOff(){try{const r=await fetch('/api/status');const d=await r.json();"
        "for(const o of d.outputs){await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:o.pin,active:false,brightness:0})});}}catch(e){console.error(e);}}"));
        
        server->sendContent(F("function refresh(){wsData=null;load();}"));
        
        server->sendContent(F("let ws;function connectWS(){const wsUrl='ws://'+window.location.hostname+':81';"
        "ws=new WebSocket(wsUrl);ws.onopen=()=>{console.log('[WS] Connected');};"
        "ws.onmessage=(e)=>{try{wsData=JSON.parse(e.data);load();}catch(err){console.error('[WS] Parse error:',err);}};"
        "ws.onerror=(e)=>{console.error('[WS] Error:',e);};"
        "ws.onclose=()=>{console.log('[WS] Disconnected, reconnecting...');setTimeout(connectWS,2000);}};"
        "const savedTab=localStorage.getItem('activeTab');if(savedTab!==null){showTab(parseInt(savedTab));}load().then(()=>connectWS());</script>"
        "<footer style='text-align:center;padding:20px;margin-top:40px;border-top:1px solid #333;color:#666;font-size:0.9em;'>Made with ❤️ by innoMO</footer>"
        "</body></html>"));
        server->sendContent("");  // End chunked transfer
    });
    
    // API endpoint for status
    server->on("/api/status", HTTP_GET, []() {
        unsigned long startTime = millis();
        IPAddress clientIP = server->client().remoteIP();
        Serial.print("[WEB] GET /api/status from ");
        Serial.println(clientIP.toString());
        
        DynamicJsonDocument doc(2048);
        doc["macAddress"] = macAddress;
        doc["name"] = customDeviceName;
        doc["wifiMode"] = WiFi.getMode() == WIFI_AP ? "AP" : "STA";
        doc["ip"] = WiFi.getMode() == WIFI_AP ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
        doc["ssid"] = WiFi.getMode() == WIFI_AP ? String(AP_SSID) : WiFi.SSID();
        doc["apClients"] = WiFi.softAPgetStationNum();
        doc["freeHeap"] = ESP.getFreeHeap();
        doc["uptime"] = millis();
        doc["flashTotal"] = ESP.getFlashChipSize();
        doc["flashUsed"] = ESP.getSketchSize();
        doc["flashFree"] = ESP.getFreeSketchSpace();
        
