Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        JsonArray outputs = doc.createNestedArray("outputs");
        for (int i = 0; i < MAX_OUTPUTS; i++) {
            JsonObject output = outputs.createNestedObject();
            output["pin"] = outputPins[i];
            output["active"] = outputStates[i];
            output["brightness"] = map(outputBrightness[i], 0, 255, 0, 100);
            output["name"] = outputNames[i];
            output["interval"] = outputIntervals[i];
            output["chasingGroup"] = outputChasingGroup[i];
        }
        
        // Add chasing groups info
        JsonArray groups = doc.createNestedArray("chasingGroups");
        for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
            if (chasingGroups[i].active) {
                JsonObject group = groups.createNestedObject();
                group["groupId"] = chasingGroups[i].groupId;
                group["name"] = chasingGroups[i].name;
                group["interval"] = chasingGroups[i].interval;
                group["outputCount"] = chasingGroups[i].outputCount;
                JsonArray groupOutputs = group.createNestedArray("outputs");
                for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                    groupOutputs.add(outputPins[chasingGroups[i].outputIndices[j]]);
                }
            }
        }
        
        String response;
        serializeJson(doc, response);
        
        unsigned long duration = millis() - startTime;
        Serial.print("[WEB] Status response: ");
        Serial.print(response.length());
        Serial.print(" bytes, ");
        Serial.print(duration);
        Serial.println("ms");
        
        server->send(200, "application/json", response);
    });
    
    // API endpoint for updating output name
    server->on("/api/name", HTTP_POST, []() {
        unsigned long startTime = millis();
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/name from ");
        Serial.print(clientIP.toString());
        Serial.print(" (");
        Serial.print(body.length());
        Serial.println(" bytes)");
        
        DynamicJsonDocument doc(512);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            Serial.print("[ERROR] JSON deserialization failed: ");
            Serial.println(error.c_str());
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        int pin = doc["pin"];
        String name = doc["name"].as<String>();
        
        Serial.print("[WEB] Name update request: GPIO ");
        Serial.print(pin);
        Serial.print(" -> '");
        Serial.print(name);
        Serial.println("'");
        
        // Find output index by pin
        int outputIndex = -1;
        for (int i = 0; i < MAX_OUTPUTS; i++) {
            if (outputPins[i] == pin) {
                outputIndex = i;
                break;
            }
        }
        
        if (outputIndex >= 0) {
            saveOutputName(outputIndex, name);
            unsigned long duration = millis() - startTime;
            Serial.print("[WEB] Name update complete (");
            Serial.print(duration);
            Serial.println("ms)");
            broadcastStatus();
            server->send(200, "application/json", "{\"success\":true}");
        } else {
            Serial.print("[ERROR] GPIO pin not found: ");
            Serial.println(pin);
            server->send(404, "application/json", "{\"error\":\"Output not found\"}");
        }
    });
    
    // API endpoint for updating output blink interval
    server->on("/api/interval", HTTP_POST, []() {
        unsigned long startTime = millis();
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/interval from ");
        Serial.print(clientIP.toString());
        Serial.print(" (");
        Serial.print(body.length());
        Serial.println(" bytes)");
        
        DynamicJsonDocument doc(512);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            Serial.print("[ERROR] JSON deserialization failed: ");
            Serial.println(error.c_str());
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        int pin = doc["pin"];
        unsigned int interval = doc["interval"];
        
        Serial.print("[WEB] Interval update request: GPIO ");
        Serial.print(pin);
        Serial.print(" -> ");
        Serial.print(interval);
        Serial.println("ms");
        
        // Find output index by pin
        int outputIndex = -1;
        for (int i = 0; i < MAX_OUTPUTS; i++) {
            if (outputPins[i] == pin) {
                outputIndex = i;
                break;
            }
        }
        
        if (outputIndex >= 0) {
            setOutputInterval(outputIndex, interval);
            unsigned long duration = millis() - startTime;
            Serial.print("[WEB] Interval update complete (");
            Serial.print(duration);
            Serial.println("ms)");
            broadcastStatus();
            server->send(200, "application/json", "{\"success\":true}");
        } else {
            Serial.print("[ERROR] GPIO pin not found: ");
            Serial.println(pin);
            server->send(404, "application/json", "{\"error\":\"Output not found\"}");
        }
    });
    
    // API endpoint for control
    server->on("/api/control", HTTP_POST, []() {
        unsigned long startTime = millis();
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/control from ");
        Serial.print(clientIP.toString());
        Serial.print(" (");
        Serial.print(body.length());
        Serial.println(" bytes)");
        
        DynamicJsonDocument doc(1024);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            Serial.print("[ERROR] JSON deserialization failed: ");
            Serial.println(error.c_str());
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
