Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        int pin = doc["pin"];
        bool active = doc["active"];
        int brightness = doc["brightness"] | 100;
        
        Serial.print("[WEB] Control request: GPIO ");
        Serial.print(pin);
        Serial.print(" -> ");
        Serial.print(active ? "ON" : "OFF");
        Serial.print(" @ ");
        Serial.print(brightness);
        Serial.println("%");
        
        executeOutputCommand(pin, active, brightness);
        
        unsigned long duration = millis() - startTime;
        Serial.print("[WEB] Control complete (");
        Serial.print(duration);
        Serial.println("ms)");
        
        server->send(200, "application/json", "{\"status\":\"ok\"}");
    });
    
    // API endpoint for creating chasing group
    server->on("/api/chasing/create", HTTP_POST, []() {
        unsigned long startTime = millis();
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/chasing/create from ");
        Serial.print(clientIP.toString());
        Serial.print(" (");
        Serial.print(body.length());
        Serial.println(" bytes)");
        
        DynamicJsonDocument doc(1024);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            Serial.print("[ERROR] JSON deserialization failed: ");
            Serial.println(error.c_str());
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        uint8_t groupId = doc["groupId"];
        unsigned int interval = doc["interval"];
        JsonArray outputs = doc["outputs"];
        const char* groupName = doc.containsKey("name") ? doc["name"].as<const char*>() : nullptr;
        
        if (outputs.size() == 0 || outputs.size() > 8) {
            server->send(400, "application/json", "{\"error\":\"Invalid output count (1-8)\"}");
            return;
        }
        
        // Convert output pins to indices
        uint8_t outputIndices[8];
        uint8_t count = 0;
        for (JsonVariant v : outputs) {
            int pin = v.as<int>();
            // Find output index by pin
            for (int i = 0; i < MAX_OUTPUTS; i++) {
                if (outputPins[i] == pin) {
                    outputIndices[count++] = i;
                    break;
                }
            }
        }
        
        if (count != outputs.size()) {
            server->send(400, "application/json", "{\"error\":\"Invalid GPIO pin(s)\"}");
            return;
        }
        
        createChasingGroup(groupId, outputIndices, count, interval, groupName);
        
        unsigned long duration = millis() - startTime;
        Serial.print("[WEB] Chasing group created (");
        Serial.print(duration);
        Serial.println("ms)");
        
        server->send(200, "application/json", "{\"success\":true}");
    });
    
    // API endpoint for deleting chasing group
    server->on("/api/chasing/delete", HTTP_POST, []() {
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/chasing/delete from ");
        Serial.println(clientIP.toString());
        
        DynamicJsonDocument doc(256);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        uint8_t groupId = doc["groupId"];
        deleteChasingGroup(groupId);
        
        server->send(200, "application/json", "{\"success\":true}");
    });
    
    // API endpoint for updating chasing group name
    server->on("/api/chasing/name", HTTP_POST, []() {
        IPAddress clientIP = server->client().remoteIP();
        String body = server->arg("plain");
        Serial.print("[WEB] POST /api/chasing/name from ");
        Serial.println(clientIP.toString());
        
        DynamicJsonDocument doc(256);
        DeserializationError error = deserializeJson(doc, body);
        
        if (error) {
            server->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
            return;
        }
        
        uint8_t groupId = doc["groupId"];
        const char* newName = doc["name"];
        
        // If name is empty or null, use default "Group X"
        char finalName[21];
        if (newName == nullptr || strlen(newName) == 0) {
            snprintf(finalName, sizeof(finalName), "Group %d", groupId);
        } else {
            strncpy(finalName, newName, 20);
            finalName[20] = '\0';
        }
        
        // Find and update group
        bool found = false;
        for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
            if (chasingGroups[i].active && chasingGroups[i].groupId == groupId) {
                strncpy(chasingGroups[i].name, finalName, 20);
                chasingGroups[i].name[20] = '\0';
                saveChasingGroups();
                found = true;
                Serial.print("[CHASING] Updated group ");
                Serial.print(groupId);
                Serial.print(" name to '");
                Serial.print(finalName);
                Serial.println("'");
                break;
            }
        }
        
        if (found) {
            broadcastStatus();
            server->send(200, "application/json", "{\"success\":true}");
        } else {
            server->send(404, "application/json", "{\"error\":\"Group not found\"}");
        }
    });
    
    // API endpoint to reset saved states
    server->on("/api/reset", HTTP_POST, []() {
        IPAddress clientIP = server->client().remoteIP();
        Serial.print("[WEB] POST /api/reset from ");
        Serial.println(clientIP.toString());
        Serial.println("[EEPROM] Resetting all saved states...");
        Serial.print("[EEPROM] Free heap before reset: ");
        Serial.print(ESP.getFreeHeap());
        Serial.println(" bytes");
        
        // Clear EEPROM data
        for (int i = 0; i < EEPROM_SIZE; i++) {
            EEPROM.write(i, 0xFF);
        }
        EEPROM.commit();
        
        Serial.println("[EEPROM] All saved states cleared!");
        Serial.print("[EEPROM] Free heap after reset: ");
        Serial.print(ESP.getFreeHeap());
        Serial.println(" bytes");
        
        server->send(200, "application/json", "{\"status\":\"reset_complete\"}");
    });
    
    server->begin();
    Serial.println("[WEB] Web server started on port 80");
    Serial.println("[WEB] Available endpoints:");
    Serial.println("[WEB]   GET  /                   - Main control interface");
    Serial.println("[WEB]   GET  /api/status         - System and output status");
    Serial.println("[WEB]   POST /api/control        - Control output state/brightness");
    Serial.println("[WEB]   POST /api/name           - Update output name");
    Serial.println("[WEB]   POST /api/interval       - Set output blink interval");
    Serial.println("[WEB]   POST /api/chasing/create - Create chasing light group");
    Serial.println("[WEB]   POST /api/chasing/delete - Delete chasing light group");
    Serial.println("[WEB]   POST /api/reset          - Reset all saved preferences");
}